Public Class Form许可证
    Private Sub Form许可证_Load(sender As Object, e As EventArgs) Handles MyBase.Load
        Me.ModernTextBox1.Text = $"请注意，LakeUI 是收费软件，要在公开发布的产品中使用必须取得对应许可，以下列出了不同用途的收费标准。LakeUI 主要面向个人项目提供，可以直接在 afdian 和 Payhip 上购买，无需通过其他方式联系我。此处列出的价格仅供参考，因为可能受到汇率影响，请以销售平台上的实际价格为准。

❗ 由于虚拟商品的特殊性和全自动发货机制，付款成功即收到唯一许可证编号，概不退换！
❗ 获得编号后您可以将其悬挂于您产品的关于板块以供社会监督。

【自由许可证】
如果您正在完全没有盈利的开源项目中使用，无需购买，直接使用即可。
❌ 如果您使用了赞助模式，则不适用
❌ 如果您加入了第三方广告来盈利，则不适用
❗ 必须完全开源，如果是闭源或部分开源则不适用
✅ 如果是为了完成学业，在学校使用，也无需购买

【赞助许可证】
顾名思义，如果您的项目只通过用户自愿赞助或第三方广告来盈利，选择此许可就对了，价格大约是 20 CNY。
✅ 闭源和部分开源适用
❌ 如果有任何付费解锁的功能，则不适用

【商业许可证】
显然，您需要项目的收益，不论您的项目是可选付费、强制付费、订阅制、买断制还是其他需要用户付费才能解锁的功能，选择此许可就对了，价格大约是 600 CNY。
✅ 以上许可证都不限制于项目，只需一次付款
✅ 以上许可证都绑定于个人，不支持转让

【企业许可证】
❗ 企业向来是不会使用 WinForms 的，所以不直接提供适用于企业的许可，当然如果确实需要，请联系我以定制订阅价格。"
    End Sub
End Class